Repository: MetaModels/filter_perimetersearch
Catalog: src/Resources/translations/*_metamodel_filtersetting.*.xlf
Languages: de

# typenames.perimetersearch
source: Perimetersearch
de: Umkreissuche

# geolocation_legend
source: Geolocation settings
de: Geolocation-Einstellungen

# range_legend
source: Range settings
de: Bereichseinstellungen

# country_legend
source: Country settings
de: Ländereinstellung

# fefilter_legend
source: Frontendfilter settings
de: Frontendfilter-Einstellungen

# datamode.label
source: Data mode
de: Datenmodus

# datamode.description
source: Here you can choose if you have one single attribute or two attributes.
de: Hier können Sie auswählen, ob ein oder zwei Attribute für die Übergabe der Geokoordinaten genutzt werden sollen.

# single_attr_id.label
source: Attribute
de: Attribut

# single_attr_id.description
source: Choose the attribute with the latitude and longitude values.
de: Wählen Sie das Attribut aus, in dem die Werte für geografische Länge und Breite gespeichert sind.

# first_attr_id.label
source: Attribute - Latitude
de: Attribut - geografische Breite (Lat)

# first_attr_id.description
source: Choose the attribute for the latitude values.
de: Bitte wählen Sie das Attribut für den geografischen Breitenwert aus.

# second_attr_id.label
source: Attribute - Longitude
de: Attribut - geografische Länge (Lng)

# second_attr_id.description
source: Choose the attribute for the longitude values.
de: Bitte wählen Sie das Attribut für den geografischen Längenwert aus.

# rangemode.label
source: Range mode
de: Bereichsmodus

# rangemode.description
source: Here you can choose how the range will be displayed.
de: Hier können Sie auswählen, wie der Bereich angezeigt werden soll.

# range_preset.label
source: Range preset
de: Bereichs-Voreinstellung

# range_preset.description
source: Here you can add a preset range.
de: Hier können Sie Werte für die Größe des Suchbereiches vorbelegen.

# range_selection.label
source: Range selection
de: Bereichsauswahl

# range_selection.description
source: Here you can add values.
de: Hier können Sie Werte direkt eingeben.

# range_selection_default.label
source: Default
de: Standard

# range_selection_default.description
source: Here you can set the default value.
de: Hier können Sie den Standardwert auswählen.

# lookupservice.label
source: LookUp services
de: LookUp-Service

# lookupservice.description
source: Here you can choose a look up service for resolving address data.
de: Hier können Sie auswählen, welcher Dienst benutzt wird um Adressdaten aufzulösen.

# lookupservice_service.label
source: LookUp services
de: LookUp-Service

# lookupservice_service.description
source: Here you can choose a look up service for resolving address data.
de: Hier können Sie auswählen, welcher Dienst benutzt wird um Adressdaten aufzulösen.

# lookupservice_api_token.description
source: Here you can add a the API token.
de: Hier können Sie ein API-Token angeben.

# range_label.label
source: Range label
de: Bereichslabel

# range_label.description
source: Show range label instead of attribute name.
de: Das Bereichslabel anstelle des Attributnamens anzeigen.

# range_placeholder.label
source: Range placeholder
de: Platzhalter für die Bereichseingabe

# range_placeholder.description
source: Show this text as long as the field is empty.
de: Zeigen Sie diesen Platzhaltertext an, solange das Feld leer ist.

# range_template.label
source: Range template
de: Bereichstemplate

# range_template.description
source: Sub template for this range filter element. Standard: form widget.
de: Subtemplate für dieses Bereichsfilter-Element. Die Standardvorgabe ist: Formwidget.

# countrymode.label
source: Country mode
de: Länder-Modus

# countrymode.description
source: Here you can choose how the country will used.
de: Hier können Sie das verwendete Land wählen.

# country_preset.label
source: Country preset
de: Vorgabe für Land

# country_preset.description
source: Here you can add a preset for the country.
de: Hier können Sie eine Vorgabe für das Land hinzufügen.

# country_get.label
source: GET-Parameter for country
de: GET-Parameter für Land

# country_get.description
source: Here you can add the GET-Parameter name for the country lookup.
de: Hier können Sie einen GET-Parameter für ein Land vorgeben.

# datamode_options.single
source: Single Mode - One attribute
de: Einzelmodus - ein Attribut

# datamode_options.multi
source: Multi Mode - Two attributes
de: Multimodus - mehrere Attribute

# rangemode_options.free
source: Free input mode
de: Freie Eingabe

# rangemode_options.preset
source: Preset by system
de: Voreinstellung aus Systemeinstellungen

# rangemode_options.selection
source: Selection mode
de: Auswahlmodus

# countrymode_options.none
source: None
de: Nichts

# countrymode_options.preset
source: Preset by system
de: Voreinstellung aus Systemeinstellungen

# countrymode_options.get
source: Use GET-Parameter
de: GET-Parameter verwenden

# perimetersearch.coordinates
source: Coordinates input
de: Koordinateneingabe

# perimetersearch.google_maps
source: GoogleMaps Lookup
de: GoogleMaps-Koordinatensuche

# perimetersearch.open_street_maps
source: OpenStreetMap Lookup
de: OpenStreetMap-Koordinatensuche
